In [2]:
%load_ext autoreload
%autoreload 2

## Evaluation Criteria
- The import of data into the database should work correctly
- The implemented functionality/queries should work correctly as desribed by problem text
- The implemented functionality/queries should be clear and easy to understand
- The efficiency of the code is not considered as an evaluation criteria in this exercise
- The connection to programming language should be clear and easy to understand
- The code should be implemented by the group members and for this exercise, i.e. copying code from
  others or by the use of AI tools (CoPilot, ChatGPT and similar) is considered as cheating
- Clear and understandable report as described by the problem text

In [3]:
import database

In [4]:
db_conn = database.CustomDbConnector()

You are connected to the database: mongo
-----------------------------------------------

## Part 1, import

In [5]:
import importer

In [6]:
imprt = importer.Importer(db_conn.db)

In [7]:
imprt.import_with_backreferences()

----------------------Starting import_with_backreferences-----------------------
--------------Finished import_with_backreferences in 28981.461 ms---------------

/Users/larswaage/Code/large-distributed-data/src/mongodb/importer.py:243: UserWarning: Already imported, run `wipe_collections` and try again
  warnings.warn("Already imported, run `wipe_collections` and try again")

### Samples

In [8]:
imprt.user_sample()

   _id  has_labels                                         activities
0    0       False  [653932bfede37941150aca5b, 653932bfede37941150...
1    1       False  [653932c0ede37941150acaf6, 653932c0ede37941150...
2    2       False  [653932c0ede37941150acb2f, 653932c0ede37941150...
3    3       False  [653932c1ede37941150acbc1, 653932c1ede37941150...
4    4       False  [653932c2ede37941150accc6, 653932c3ede37941150...
5    5       False  [653932c4ede37941150ace20, 653932c4ede37941150...
6    6       False  [653932c5ede37941150ace69, 653932c5ede37941150...
7    7       False  [653932c5ede37941150ace81, 653932c5ede37941150...
8    8       False  [653932c5ede37941150acea9, 653932c5ede37941150...
9    9       False  [653932c5ede37941150acec0, 653932c5ede37941150...

In [9]:
imprt.activity_sample()

,_id,user_id,start_datetime,end_datetime,transportation_mode,track_points
0,653932bfede37941150aca5b,0,2009-04-12 07:33:03,2009-04-12 17:24:59,,"[65393317ede37941150b090b, 65393317ede37941150..."
1,653932bfede37941150aca5c,0,2009-05-10 02:02:06,2009-05-10 06:20:11,,"[65393317ede37941150b0fe5, 65393317ede37941150..."
2,653932bfede37941150aca5d,0,2008-12-01 11:18:27,2008-12-01 11:35:15,,"[65393317ede37941150b1316, 65393317ede37941150..."
3,653932bfede37941150aca5e,0,2009-06-21 10:14:07,2009-06-21 14:47:12,,"[65393317ede37941150b13cd, 65393317ede37941150..."
4,653932bfede37941150aca5f,0,2008-12-11 12:14:32,2008-12-11 12:24:32,,"[65393317ede37941150b1b15, 65393317ede37941150..."
5,653932bfede37941150aca60,0,2009-06-29 01:16:30,2009-06-29 11:13:12,,"[65393317ede37941150b1b8e, 65393317ede37941150..."
6,653932bfede37941150aca61,0,2009-05-09 18:16:36,2009-05-09 18:30:36,,"[65393317ede37941150b2350, 65393317ede37941150..."
7,653932bfede37941150aca62,0,2009-07-03 00:28:00,2009-07-03 08:37:23,,"[65393317ede37941150b23fd, 65393317ede37941150..."
8,653932bfede37941150aca63,0,2009-06-07 07:52:55,2009-06-07 09:46:03,,"[65393317ede37941150b2af9, 65393317ede37941150..."
9,653932bfede37941150aca64,0,2009-06-11 22:12:04,2009-06-11 22:34:54,,"[65393317ede37941150b2d7f, 65393317ede37941150..."

In [10]:
imprt.track_point_sample()

,_id,datetime,latitude,longitude,altitude,location,activity_id,user_id
0,65393317ede37941150b090b,2009-04-12 07:33:03,40.000017,116.327479,105.0,"{'type': 'Point', 'coordinates': [116.327479, ...",653932bfede37941150aca5b,000
1,65393317ede37941150b090c,2009-04-12 07:33:09,40.000168,116.327474,80.0,"{'type': 'Point', 'coordinates': [116.327474, ...",653932bfede37941150aca5b,000
2,65393317ede37941150b090d,2009-04-12 07:33:14,40.000055,116.327454,99.0,"{'type': 'Point', 'coordinates': [116.327454, ...",653932bfede37941150aca5b,000
3,65393317ede37941150b090e,2009-04-12 07:33:19,40.000021,116.327407,109.0,"{'type': 'Point', 'coordinates': [116.327407, ...",653932bfede37941150aca5b,000
4,65393317ede37941150b090f,2009-04-12 07:33:24,40.000035,116.327281,111.0,"{'type': 'Point', 'coordinates': [116.327281, ...",653932bfede37941150aca5b,000
5,65393317ede37941150b0910,2009-04-12 07:33:29,39.999983,116.327285,114.0,"{'type': 'Point', 'coordinates': [116.327285, ...",653932bfede37941150aca5b,000
6,65393317ede37941150b0911,2009-04-12 07:33:34,39.999853,116.327267,120.0,"{'type': 'Point', 'coordinates': [116.327267, ...",653932bfede37941150aca5b,000
7,65393317ede37941150b0912,2009-04-12 07:33:39,39.999745,116.327165,125.0,"{'type': 'Point', 'coordinates': [116.327165, ...",653932bfede37941150aca5b,000
8,65393317ede37941150b0913,2009-04-12 07:33:44,39.999661,116.326997,126.0,"{'type': 'Point', 'coordinates': [116.326997, ...",653932bfede37941150aca5b,000
9,65393317ede37941150b0914,2009-04-12 07:33:49,39.999528,116.326873,127.0,"{'type': 'Point', 'coordinates': [116.326873, ...",653932bfede37941150aca5b,000

## Part 2, tasks

### Setup

In [11]:
import tasks
task = tasks.Task(db_conn.db)

### Task 1

In [12]:
t1 = task.task1()
t1

---------------------------------Starting task1---------------------------------
-------------------------Finished task1 in 12397.441 ms-------------------------

   # users  # activities  # track points
0      182         16048         9681756

### Task 2

In [13]:
t2 = task.task2()
t2

---------------------------------Starting task2---------------------------------
---------------------------Finished task2 in 4.856 ms---------------------------

   min_activity_count  max_activity_count  avg_activity_count
0                   0                2102           88.175824

### Task 3

In [14]:
t3 = task.task3()
t3

---------------------------------Starting task3---------------------------------
---------------------------Finished task3 in 3.601 ms---------------------------

    _id  activity_count
0   128            2102
1   153            1793
2    25             715
3   163             704
4    62             691
5   144             563
6    41             399
7    85             364
8     4             346
9   140             345
10  167             320
11   68             280
12   17             265
13    3             261
14   14             236
15  126             215
16   30             210
17  112             208
18   11             201
19   39             198

### Task 4

In [15]:
t4 = task.task4()
t4

---------------------------------Starting task4---------------------------------
--------------------------Finished task4 in 18.658 ms---------------------------

   Users Who Have Taken a Taxi
0                           10
1                           58
2                           62
3                           78
4                           80
5                           85
6                           98
7                          111
8                          128
9                          163

### Task 5

In [16]:
t5 = task.task5()
t5

---------------------------------Starting task5---------------------------------
---------------------------Finished task5 in 7.354 ms---------------------------

        _id  transportation_mode_count
0      walk                        481
1       car                        419
2      bike                        262
3       bus                        199
4    subway                        133
5      taxi                         37
6  airplane                          3
7     train                          2
8       run                          1
9      boat                          1

### Task 6

#### Task 6a

In [17]:
t6a = task.task6a()
t6a

--------------------------------Starting task6a---------------------------------
--------------------------Finished task6a in 22.447 ms--------------------------

   activityCount  year
0           5895  2008

#### Task 6b

In [18]:
t6b = task.task6b()
t6b

     totalHours  year
0  11612.423889  2009

### Task 8

In [26]:
import pandas as pd
track_points = task.db.track_points.find(
            {
                # Altitude values of -777 are invalid, so we exclude them
                "altitude": {"$ne": -777}
            },
            {"activity_id": 1, "altitude": 1, "datetime": 1, "user_id": 1},
        # Sort by `activity_id`, then `datetime` to ensure that consecutive track points for the same activity are
        # returned as consecutive documents.
        ).sort(["activity_id", "datetime"])

df = pd.DataFrame(list(track_points))

In [28]:
df["Δ altitude"] = df["altitude"].diff()

In [30]:
same_activity_as_previous_index = df["activity_id"].eq(df["activity_id"].shift())

In [31]:
positive_altitude_gain = df["Δ altitude"] >= 0

In [33]:
altitude_gains_within_activity = same_activity_as_previous_index & positive_altitude_gain

In [60]:
altitude_gain_per_activity = df[altitude_gains_within_activity][["user_id", "activity_id", "Δ altitude"]].groupby(["user_id", "activity_id"]).sum()

In [61]:
altitude_gain_per_user = altitude_gain_per_activity.groupby(["user_id"]).sum()

In [75]:
pd.options.display.float_format = "{:,.0f}".format
altitude_gain_per_user.sort_values(["Δ altitude"], ascending=False)

         Δ altitude
user_id
128       2,135,669
153       1,820,737
004       1,089,358
041         789,924
003         766,613
...             ...
141               0
068               0
159               0
132               0
131               0

[173 rows x 1 columns]

In [ ]:
df

,_id,datetime,altitude,activity_id,user_id,Δ altitude
0,65393317ede37941150b090b,2009-04-12 07:33:03,105.000000,653932bfede37941150aca5b,000,NaN
1,65393317ede37941150b090c,2009-04-12 07:33:09,80.000000,653932bfede37941150aca5b,000,-25.000000
2,65393317ede37941150b090d,2009-04-12 07:33:14,99.000000,653932bfede37941150aca5b,000,19.000000
3,65393317ede37941150b090e,2009-04-12 07:33:19,109.000000,653932bfede37941150aca5b,000,10.000000
4,65393317ede37941150b090f,2009-04-12 07:33:24,111.000000,653932bfede37941150aca5b,000,2.000000
...,...,...,...,...,...,...
9677027,6539333aede37941159ec462,2007-12-08 07:09:44,249.343832,65393306ede37941150b090a,181,72.178478
9677028,6539333aede37941159ec463,2007-12-08 07:11:20,173.884514,65393306ede37941150b090a,181,-75.459318
9677029,6539333aede37941159ec464,2007-12-08 07:12:42,187.007874,65393306ede37941150b090a,181,13.123360
9677030,6539333aede37941159ec465,2007-12-08 07:14:02,226.377953,65393306ede37941150b090a,181,39.370079
9677031,6539333aede37941159ec466,2007-12-08 07:15:40,118.110236,65393306ede37941150b090a,181,-108.267717

### Task 9

In [20]:
t9 = task.task9()
t9

---------------------------------Starting task9---------------------------------
Fetching track points
Loading into DataFrame
Convert datetime to datetime
Find time diff
Find indices where time diff exceeds 5 minutes
Find indices where activity id is equal to the previous index
Find indices where activity id is the same as the previous index AND the time difference exceeds 5 minutes
Find all invalid track points
Drop duplicates on activity id
Group by user and count the number of activity ids
-------------------------Finished task9 in 95780.986 ms-------------------------

         activity_id
user_id
000              101
001               45
002               98
003              179
004              219
...              ...
175                4
176                8
179               28
180                2
181               14

[171 rows x 1 columns]

### Task 10

In [21]:
t10 = task.task10(how="polygon")
t10

--------------------------------Starting task10---------------------------------
-------------------------Finished task10 in 6963.429 ms-------------------------

   Users in the Forbidden City
0                          004
1                          018
2                          019
3                          025
4                          052
5                          062
6                          119
7                          128
8                          131
9                          136
10                         140
11                         144
12                         153
13                         163
14                         168
15                         169

### Task 11

In [22]:
t11 = task.task11()
t11

--------------------------------Starting task11---------------------------------
-------------------------Finished task11 in 111.634 ms--------------------------

    user_id most_used_transportation_mode  transportation_mode_count
0        10                           bus                          3
1        20                          walk                         80
2        21                          walk                          1
3        52                           bus                          1
4        56                          bike                         15
5        58                           car                          2
6        60                          walk                          1
7        62                          walk                        173
8        64                          bike                          1
9        65                          bike                         10
10       67                          walk                          1
11       69                          bike                          1
12       73                          walk                         52
13       75                          walk                          1
14       76                           car                          3
15       78                          taxi                         37
16       80                          bike                          1
17       81                           bus                          4
18       82                          walk                          2
19       84                          walk                          9
20       85                          taxi                         18
21       86                           car                          2
22       87                          walk                          5
23       89                           car                          7
24       91                          walk                          2
25       92                           bus                          1
26       97                          bike                          9
27       98                          taxi                          1
28      101                           car                          3
29      102                          walk                          7
30      107                          walk                          1
31      108                          walk                          2
32      111                          taxi                          3
33      112                          walk                         69
34      115                           car                         80
35      117                          walk                          1
36      125                          bike                          3
37      126                          bike                         13
38      128                        subway                        312
39      136                          walk                          3
40      138                          bike                          2
41      139                          walk                          4
42      144                          walk                          2
43      153                          walk                          5
44      161                          walk                          1
45      163                          walk                         26
46      167                          walk                         31
47      175                           bus                          1